Revit 2024 API
SpecTypeId.LinearForceScale Property
 Linear Force Scale, in discipline Structural.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public static ForgeTypeId LinearForceScale { get; }
Visual Basic
Public Shared ReadOnly Property LinearForceScale As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ LinearForceScale {
	ForgeTypeId^ get ();
}
See Also
SpecTypeId Class
Autodesk.Revit.DB Namespace